<script lang="ts">
	let isOpen = false;
</script>

<div class="w-full max-w-[1280px] py-4" style={!isOpen ? `height: 20%; overflow:hidden` : ''}>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Авто в наявності</h2>
		<p>
			Наш каталог авто з Європи в наявності постійно оновлюється. Тут ви знайдете широкий вибір авто
			на будь-який смак та бюджет. Всі машини проходять детальну перевірку, тому ви можете бути
			впевнені в їх якості та надійності.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Авто у дорозі</h2>
		<p>
			Крім наявних автомобілів, ми також пропонуємо авто, які вже в дорозі до України. Це дає
			можливість оформити замовлення на вподобаний автомобіль заздалегідь та отримати його в
			найкоротший термін. Ми завжди інформуємо наших клієнтів про статус їх замовлення. Купуючи авто
			з Європи в Україну, ви отримуєте перевірений транспортний засіб з усіма необхідними
			документами.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Купити авто з Європи з перевіреним пробігом без пошкоджень</h2>
		<p>
			Покупка авто з Європи може бути простим та вигідним рішенням, особливо якщо звернутися до
			професіоналів Auto&Company. Ми пропонуємо вживані авто з перевіреним пробігом та без
			пошкоджень, гарантуючи високу якість та надійність.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Фотовідгуки наших клієнтів</h2>
		<p>
			Довіра клієнтів – наш головний пріоритет. Перегляньте фотовідгуки від щасливих власників
			автомобілів, придбаних через Auto&Company. Вони підтверджують якість нашої роботи та
			надійність наших послуг. Вживані машини з ЄС отримують високу оцінку від наших клієнтів
			завдяки їх надійності та стану.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Критерії підбору машин з Європи</h2>
		<p>
			Ми ретельно відбираємо автомобілі з Європи, керуючись кількома основними критеріями: Стан
			автомобіля: Ми обираємо лише ті бу машини, які знаходяться у відмінному технічному стані.
			Перевірений пробіг: Всі автомобілі мають чесний пробіг, що підтверджується документально.
			Відсутність пошкоджень: Ми не купуємо машини з пошкодженнями або після аварій.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Переваги вживаних авто з Європи - чому це вигідно</h2>
		<p>
			Вища якість: європейські автомобілі відомі своєю надійністю та якістю складання. Широкий
			вибір: великий ринок вживаних автомобілів дозволяє знайти оптимальний варіант за привабливою
			ціною. Комплектація: багато автомобілів з Європи мають вищий рівень комплектації порівняно з
			аналогами на українському ринку.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Скільки коштує пригнати автомобіль з Європи</h2>
		<p>
			Вартість пригoну автомобіля з Європи залежить від кількох факторів: Ціна автомобіля: Вартість
			обраного авто на європейському ринку. Послуги доставки: Логістичні витрати на транспортування
			автомобіля в Україну. Митні збори: Вартість розмитнення залежить від віку, об'єму двигуна та
			інших параметрів авто.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Як формується кінцева вартість автомобіля</h2>
		<p>
			До ціни авто під замовлення з Європи додається ще вартість розмитнення, доставка, послуги
			аукціону та наші послуги. Кожен автомобіль прораховується індивідуально. Підбираємо авто за
			Вашими побажаннями та під погоджений з Вами бюджет.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Чому варто обрати Auto&Company</h2>
		<p>
			Auto&Company пропонує найкращі ціни на вживані машини з Європи з перевіреним пробігом, без
			пошкоджень. Від пошуку до доставки, оформлення документів та реєстрації авто в Україні – ми
			забезпечимо безпечну та вигідну покупку вашого автомобіля.
		</p>
	</div>
	<div class="flex w-full flex-col gap-3">
		<h2 class="text-2xl font-bold">Питання - Відповідь</h2>
		<p>
			<b>Як можна перевірити машину перед покупкою?</b>
			<br />
			Ми надаємо повний звіт про технічний стан автомобіля, включаючи його історію, перевірку пробігу
			та відсутність пошкоджень.
			<br />
			<b>Як довго очікувати авто з Європи в Україні?</b>
			<br />
			Зазвичай доставка автомобіля займає місяць час, в залежності від місця знаходження авто та логістичних
			умов.
			<br />
			<b>Які документи необхідні, щоб купити автомобіль?</b>
			<br />
			Для купівлі авто необхідно надати паспорт, ідентифікаційний код та договір купівлі-продажу. Наші
			фахівці допоможуть оформити всі необхідні документи.
			<br />
			<b>Які марки автомобілів можна пригнати і що входить у вартість?</b>
			<br />
			Ми працюємо з усіма популярними марками європейських автомобілів. У вартість входять всі витрати
			на придбання, доставку, розмитнення та оформлення документів
		</p>
	</div>
</div>
<button onclick={() => (isOpen = !isOpen)} class="rounded-xl bg-red-600 px-2 py-1 text-white">
	{#if !isOpen}
		Показати
	{:else}
		Сховати
	{/if}
</button>
